GrumpyOldPizza/arduino-STM32L4/boards.txt
menu.usb=USB Type
menu.dosfs=DOSFS
menu.speed=CPU Speed
menu.opt=Optimize

##############################################################

# Tlera Dragonfly
# ---------------------------------------
Dragonfly-L476RE.name=Dragonfly-L476RE
Dragonfly-L476RE.vid.0=0x1209
Dragonfly-L476RE.pid.0=0x6667

Dragonfly-L476RE.upload.tool=stm32l4_dfu
Dragonfly-L476RE.upload.protocol=dfu
Dragonfly-L476RE.upload.maximum_size=507904
Dragonfly-L476RE.upload.use_1200bps_touch=true
Dragonfly-L476RE.upload.wait_for_upload_port=false
Dragonfly-L476RE.upload.native_usb=false

Dragonfly-L476RE.bootloader.tool=stm32l4_dfu
Dragonfly-L476RE.bootloader.protocol=dfu
Dragonfly-L476RE.bootloader.file=dragonfly.bin

Dragonfly-L476RE.build.mcu=cortex-m4
Dragonfly-L476RE.build.f_cpu=80000000L
Dragonfly-L476RE.build.board=Dragonfly-L476RE
Dragonfly-L476RE.build.arch=STM32L4
Dragonfly-L476RE.build.core=stm32l4
Dragonfly-L476RE.build.usb_manufacturer=u"\u0324Tlera Corporation"
Dragonfly-L476RE.build.usb_product=u"\u0314Dragonfly"
Dragonfly-L476RE.build.vid=0x1209
Dragonfly-L476RE.build.pid=0x6667
Dragonfly-L476RE.build.extra_flags=-DSTM32L476xx -D__FPU_PRESENT=1 -march=armv7e-m -mthumb -mfloat-abi=hard -mfpu=fpv4-sp-d16 -mabi=aapcs -mslow-flash-data -fsingle-precision-constant {build.usb_flags} {build.dosfs_flags}
Dragonfly-L476RE.build.ldscript=linker_scripts/STM32L476RE_FLASH.ld
Dragonfly-L476RE.build.openocdscript=openocd_scripts/stm32l476re_dragonfly.cfg
Dragonfly-L476RE.build.variant=STM32L476RE-Dragonfly
Dragonfly-L476RE.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L4xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l476 -larm_cortexM4lf_math
Dragonfly-L476RE.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L4xx/Include" "-I{runtime.platform.path}/system/STM32L4xx/Include" 

Dragonfly-L476RE.menu.usb.cdc=Serial
Dragonfly-L476RE.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
Dragonfly-L476RE.menu.usb.cdc_msc=Serial + Mass Storage
Dragonfly-L476RE.menu.usb.cdc_msc.build.usb_type=USB_TYPE_CDC_MSC
Dragonfly-L476RE.menu.usb.none=No USB
Dragonfly-L476RE.menu.usb.none.build.usb_type=USB_TYPE_NONE

Dragonfly-L476RE.menu.dosfs.sflash=SFLASH (QSPI)
Dragonfly-L476RE.menu.dosfs.sflash.build.dosfs_sdcard=0
Dragonfly-L476RE.menu.dosfs.sflash.build.dosfs_sflash=2
Dragonfly-L476RE.menu.dosfs.sdspi=SDCARD (SPI)
Dragonfly-L476RE.menu.dosfs.sdspi.build.dosfs_sdcard=1
Dragonfly-L476RE.menu.dosfs.sdspi.build.dosfs_sflash=0
Dragonfly-L476RE.menu.dosfs.sdmmc=SDCARD (SDIO Default Speed)
Dragonfly-L476RE.menu.dosfs.sdmmc.build.dosfs_sdcard=2
Dragonfly-L476RE.menu.dosfs.sdmmc.build.dosfs_sflash=0
Dragonfly-L476RE.menu.dosfs.sdmmc1=SDCARD (SDIO High Speed)
Dragonfly-L476RE.menu.dosfs.sdmmc1.build.dosfs_sdcard=3
Dragonfly-L476RE.menu.dosfs.sdmmc1.build.dosfs_sflash=0
Dragonfly-L476RE.menu.dosfs.none=None
Dragonfly-L476RE.menu.dosfs.none.build.dosfs_sdcard=0
Dragonfly-L476RE.menu.dosfs.none.build.dosfs_sflash=0

Dragonfly-L476RE.menu.speed.80=80 MHz
Dragonfly-L476RE.menu.speed.80.build.f_cpu=80000000L
Dragonfly-L476RE.menu.speed.72=72 MHz
Dragonfly-L476RE.menu.speed.72.build.f_cpu=72000000L
Dragonfly-L476RE.menu.speed.64=64 MHz
Dragonfly-L476RE.menu.speed.64.build.f_cpu=64000000L
Dragonfly-L476RE.menu.speed.48=48 MHz
Dragonfly-L476RE.menu.speed.48.build.f_cpu=48000000L
Dragonfly-L476RE.menu.speed.32=32 MHz
Dragonfly-L476RE.menu.speed.32.build.f_cpu=32000000L
Dragonfly-L476RE.menu.speed.24=24 MHz
Dragonfly-L476RE.menu.speed.24.build.f_cpu=24000000L
Dragonfly-L476RE.menu.speed.16=16 MHz
Dragonfly-L476RE.menu.speed.16.build.f_cpu=16000000L
Dragonfly-L476RE.menu.speed.8=8 MHz (No USB)
Dragonfly-L476RE.menu.speed.8.build.f_cpu=8000000L
Dragonfly-L476RE.menu.speed.4=4 MHz (No USB)
Dragonfly-L476RE.menu.speed.4.build.f_cpu=4000000L
Dragonfly-L476RE.menu.speed.2=2 MHz (No USB)
Dragonfly-L476RE.menu.speed.2.build.f_cpu=2000000L
Dragonfly-L476RE.menu.speed.1=1 MHz (No USB)
Dragonfly-L476RE.menu.speed.1.build.f_cpu=1000000L

Dragonfly-L476RE.menu.opt.os=Smallest Code
Dragonfly-L476RE.menu.opt.os.build.flags.optimize=-Os
Dragonfly-L476RE.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
Dragonfly-L476RE.menu.opt.o1=Fast
Dragonfly-L476RE.menu.opt.o1.build.flags.optimize=-O1
Dragonfly-L476RE.menu.opt.o1.build.flags.ldspecs=
Dragonfly-L476RE.menu.opt.o2=Faster
Dragonfly-L476RE.menu.opt.o2.build.flags.optimize=-O2
Dragonfly-L476RE.menu.opt.o2.build.flags.ldspecs=
Dragonfly-L476RE.menu.opt.o3=Fastest
Dragonfly-L476RE.menu.opt.o3.build.flags.optimize=-O3
Dragonfly-L476RE.menu.opt.o3.build.flags.ldspecs=

# Tlera Butterfly
# ---------------------------------------
Butterfly-L433CC.name=Butterfly-L433CC
Butterfly-L433CC.vid.0=0x1209
Butterfly-L433CC.pid.0=0x6668

Butterfly-L433CC.upload.tool=stm32l4_dfu
Butterfly-L433CC.upload.protocol=dfu
Butterfly-L433CC.upload.maximum_size=245760
Butterfly-L433CC.upload.use_1200bps_touch=true
Butterfly-L433CC.upload.wait_for_upload_port=false
Butterfly-L433CC.upload.native_usb=false

Butterfly-L433CC.bootloader.tool=stm32l4_dfu
Butterfly-L433CC.bootloader.protocol=dfu
Butterfly-L433CC.bootloader.file=butterfly.bin

Butterfly-L433CC.build.mcu=cortex-m4
Butterfly-L433CC.build.f_cpu=80000000L
Butterfly-L433CC.build.board=Butterfly-L433CC
Butterfly-L433CC.build.arch=STM32L4
Butterfly-L433CC.build.core=stm32l4
Butterfly-L433CC.build.usb_manufacturer=u"\u0324Tlera Corporation"
Butterfly-L433CC.build.usb_product=u"\u0314Butterfly"
Butterfly-L433CC.build.vid=0x1209
Butterfly-L433CC.build.pid=0x6668
Butterfly-L433CC.build.extra_flags=-DSTM32L433xx -D__FPU_PRESENT=1 -march=armv7e-m -mthumb -mfloat-abi=hard -mfpu=fpv4-sp-d16 -mabi=aapcs -mslow-flash-data -fsingle-precision-constant {build.usb_flags} {build.dosfs_flags}
Butterfly-L433CC.build.ldscript=linker_scripts/STM32L433CC_FLASH.ld
Butterfly-L433CC.build.openocdscript=openocd_scripts/stm32l433cc_butterfly.cfg
Butterfly-L433CC.build.variant=STM32L433CC-Butterfly
Butterfly-L433CC.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L4xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l433 -larm_cortexM4lf_math
Butterfly-L433CC.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L4xx/Include" "-I{runtime.platform.path}/system/STM32L4xx/Include" 

Butterfly-L433CC.menu.usb.cdc=Serial
Butterfly-L433CC.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
Butterfly-L433CC.menu.usb.cdc_msc=Serial + Mass Storage
Butterfly-L433CC.menu.usb.cdc_msc.build.usb_type=USB_TYPE_CDC_MSC
Butterfly-L433CC.menu.usb.none=No USB
Butterfly-L433CC.menu.usb.none.build.usb_type=USB_TYPE_NONE

