GrumpyOldPizza/arduino-STM32L4/boards.txt
Butterfly-L433CC.menu.dosfs.none=None
Butterfly-L433CC.menu.dosfs.none.build.dosfs_sdcard=0
Butterfly-L433CC.menu.dosfs.none.build.dosfs_sflash=0
Butterfly-L433CC.menu.dosfs.sdspi=SDCARD (SPI)
Butterfly-L433CC.menu.dosfs.sdspi.build.dosfs_sdcard=1
Butterfly-L433CC.menu.dosfs.sdspi.build.dosfs_sflash=0

Butterfly-L433CC.menu.speed.80=80 MHz
Butterfly-L433CC.menu.speed.80.build.f_cpu=80000000L
Butterfly-L433CC.menu.speed.72=72 MHz
Butterfly-L433CC.menu.speed.72.build.f_cpu=72000000L
Butterfly-L433CC.menu.speed.64=64 MHz
Butterfly-L433CC.menu.speed.64.build.f_cpu=64000000L
Butterfly-L433CC.menu.speed.48=48 MHz
Butterfly-L433CC.menu.speed.48.build.f_cpu=48000000L
Butterfly-L433CC.menu.speed.32=32 MHz
Butterfly-L433CC.menu.speed.32.build.f_cpu=32000000L
Butterfly-L433CC.menu.speed.24=24 MHz
Butterfly-L433CC.menu.speed.24.build.f_cpu=24000000L
Butterfly-L433CC.menu.speed.16=16 MHz (No USB)
Butterfly-L433CC.menu.speed.16.build.f_cpu=16000000L
Butterfly-L433CC.menu.speed.8=8 MHz (No USB)
Butterfly-L433CC.menu.speed.8.build.f_cpu=8000000L
Butterfly-L433CC.menu.speed.4=4 MHz (No USB)
Butterfly-L433CC.menu.speed.4.build.f_cpu=4000000L
Butterfly-L433CC.menu.speed.2=2 MHz (No USB)
Butterfly-L433CC.menu.speed.2.build.f_cpu=2000000L
Butterfly-L433CC.menu.speed.1=1 MHz (No USB)
Butterfly-L433CC.menu.speed.1.build.f_cpu=1000000L

Butterfly-L433CC.menu.opt.os=Smallest Code
Butterfly-L433CC.menu.opt.os.build.flags.optimize=-Os
Butterfly-L433CC.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
Butterfly-L433CC.menu.opt.o1=Fast
Butterfly-L433CC.menu.opt.o1.build.flags.optimize=-O1
Butterfly-L433CC.menu.opt.o1.build.flags.ldspecs=
Butterfly-L433CC.menu.opt.o2=Faster
Butterfly-L433CC.menu.opt.o2.build.flags.optimize=-O2
Butterfly-L433CC.menu.opt.o2.build.flags.ldspecs=
Butterfly-L433CC.menu.opt.o3=Fastest
Butterfly-L433CC.menu.opt.o3.build.flags.optimize=-O3
Butterfly-L433CC.menu.opt.o3.build.flags.ldspecs=

# Tlera Ladybug
# ---------------------------------------
Ladybug-L432KC.name=Ladybug-L432KC
Ladybug-L432KC.vid.0=0x1209
Ladybug-L432KC.pid.0=0x6669

Ladybug-L432KC.upload.tool=stm32l4_dfu
Ladybug-L432KC.upload.protocol=dfu
Ladybug-L432KC.upload.maximum_size=245760
Ladybug-L432KC.upload.use_1200bps_touch=true
Ladybug-L432KC.upload.wait_for_upload_port=false
Ladybug-L432KC.upload.native_usb=false

Ladybug-L432KC.bootloader.tool=stm32l4_dfu
Ladybug-L432KC.bootloader.protocol=dfu
Ladybug-L432KC.bootloader.file=butterfly.bin

Ladybug-L432KC.build.mcu=cortex-m4
Ladybug-L432KC.build.f_cpu=80000000L
Ladybug-L432KC.build.board=Ladybug-L432KC
Ladybug-L432KC.build.arch=STM32L4
Ladybug-L432KC.build.core=stm32l4
Ladybug-L432KC.build.usb_manufacturer=u"\u0324Tlera Corporation"
Ladybug-L432KC.build.usb_product=u"\u0310Ladybug"
Ladybug-L432KC.build.vid=0x1209
Ladybug-L432KC.build.pid=0x6669
Ladybug-L432KC.build.extra_flags=-DSTM32L432xx -D__FPU_PRESENT=1 -march=armv7e-m -mthumb -mfloat-abi=hard -mfpu=fpv4-sp-d16 -mabi=aapcs -mslow-flash-data -fsingle-precision-constant {build.usb_flags} {build.dosfs_flags}
Ladybug-L432KC.build.ldscript=linker_scripts/STM32L432KC_FLASH.ld
Ladybug-L432KC.build.openocdscript=openocd_scripts/stm32l432kc_ladybug.cfg
Ladybug-L432KC.build.variant=STM32L432KC-Ladybug
Ladybug-L432KC.build.variant_system_libs="-L{runtime.platform.path}/system/STM32L4xx/Lib" "-L{runtime.platform.path}/system/CMSIS/Lib" -lstm32l432 -larm_cortexM4lf_math
Ladybug-L432KC.build.variant_system_include="-I{runtime.platform.path}/system/CMSIS/Include" "-I{runtime.platform.path}/system/CMSIS/Device/ST/STM32L4xx/Include" "-I{runtime.platform.path}/system/STM32L4xx/Include" 

Ladybug-L432KC.menu.usb.cdc=Serial
Ladybug-L432KC.menu.usb.cdc.build.usb_type=USB_TYPE_CDC
Ladybug-L432KC.menu.usb.cdc_msc=Serial + Mass Storage
Ladybug-L432KC.menu.usb.cdc_msc.build.usb_type=USB_TYPE_CDC_MSC
Ladybug-L432KC.menu.usb.none=No USB
Ladybug-L432KC.menu.usb.none.build.usb_type=USB_TYPE_NONE

Ladybug-L432KC.menu.dosfs.none=None
Ladybug-L432KC.menu.dosfs.none.build.dosfs_sdcard=0
Ladybug-L432KC.menu.dosfs.none.build.dosfs_sflash=0
Ladybug-L432KC.menu.dosfs.sdspi=SDCARD (SPI)
Ladybug-L432KC.menu.dosfs.sdspi.build.dosfs_sdcard=1
Ladybug-L432KC.menu.dosfs.sdspi.build.dosfs_sflash=0

Ladybug-L432KC.menu.speed.80=80 MHz
Ladybug-L432KC.menu.speed.80.build.f_cpu=80000000L
Ladybug-L432KC.menu.speed.72=72 MHz
Ladybug-L432KC.menu.speed.72.build.f_cpu=72000000L
Ladybug-L432KC.menu.speed.64=64 MHz
Ladybug-L432KC.menu.speed.64.build.f_cpu=64000000L
Ladybug-L432KC.menu.speed.48=48 MHz
Ladybug-L432KC.menu.speed.48.build.f_cpu=48000000L
Ladybug-L432KC.menu.speed.32=32 MHz
Ladybug-L432KC.menu.speed.32.build.f_cpu=32000000L
Ladybug-L432KC.menu.speed.24=24 MHz
Ladybug-L432KC.menu.speed.24.build.f_cpu=24000000L
Ladybug-L432KC.menu.speed.16=16 MHz (No USB)
Ladybug-L432KC.menu.speed.16.build.f_cpu=16000000L
Ladybug-L432KC.menu.speed.8=8 MHz (No USB)
Ladybug-L432KC.menu.speed.8.build.f_cpu=8000000L
Ladybug-L432KC.menu.speed.4=4 MHz (No USB)
Ladybug-L432KC.menu.speed.4.build.f_cpu=4000000L
Ladybug-L432KC.menu.speed.2=2 MHz (No USB)
Ladybug-L432KC.menu.speed.2.build.f_cpu=2000000L
Ladybug-L432KC.menu.speed.1=1 MHz (No USB)
Ladybug-L432KC.menu.speed.1.build.f_cpu=1000000L

Ladybug-L432KC.menu.opt.os=Smallest Code
Ladybug-L432KC.menu.opt.os.build.flags.optimize=-Os
Ladybug-L432KC.menu.opt.os.build.flags.ldspecs=--specs=nano.specs
Ladybug-L432KC.menu.opt.o1=Fast
Ladybug-L432KC.menu.opt.o1.build.flags.optimize=-O1
Ladybug-L432KC.menu.opt.o1.build.flags.ldspecs=
Ladybug-L432KC.menu.opt.o2=Faster
Ladybug-L432KC.menu.opt.o2.build.flags.optimize=-O2
Ladybug-L432KC.menu.opt.o2.build.flags.ldspecs=
Ladybug-L432KC.menu.opt.o3=Fastest
Ladybug-L432KC.menu.opt.o3.build.flags.optimize=-O3
Ladybug-L432KC.menu.opt.o3.build.flags.ldspecs=


# ST NUCLEO-L432KC
# ---------------------------------------
NUCLEO-L432KC.name=NUCLEO-L432KC
NUCLEO-L432KC.vid.0=0x0483
NUCLEO-L432KC.pid.0=0x374b

NUCLEO-L432KC.upload.tool=stm32l4_openocd
NUCLEO-L432KC.upload.protocol=stlink
NUCLEO-L432KC.upload.maximum_size=245760
NUCLEO-L432KC.upload.use_1200bps_touch=true
NUCLEO-L432KC.upload.wait_for_upload_port=false
NUCLEO-L432KC.upload.native_usb=false

